#ตัวดำเนินการเปรียบเทียบ

#นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
#ชนิดข้อมูลต้องเหมือนกัน
#คำตอบจะมี 2 คำตอบคือ จริง กับ เท็จ

x=10
y=5
z=8
#สามารถเขียนได้เป็น x,y=10,5 จะมีค่าเหมือนข้างบน

#print("ค่า x มากกว่า y หรือไม่ : ",x>y)
#print("ค่า x น้อยกว่า y หรือไม่ : ",x<y)
#print("ค่า x เท่ากับ y หรือไม่ : ",x==y)
#print("ค่า x ไม่เท่ากับ y หรือไม่ : ",x!=y)
#print("ค่า x มากกว่า หรือ เท่ากับ ค่า y หรือไม่ : ",x>=y)
#print("ค่า x น้อยกว่า หรือ เท่ากับ ค่า y หรือไม่ : ",x<=y)

#เปรียบเทียบค่า 3 ค่า
#และ
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ : ",x>y>z)
print("ค่า x น้อยกว่า y และ y น้อยกว่า z หรือไม่ : ",x<y<z)